
1.5 텍스트 관련 태그

- 제목 태그(headings)
제목을 나타낼 때 사용하며 h1 부터 h6까지의 태그가 있음
h1이 가장 중요한 제목을 의미, 글자 크기도 가장 큼

시맨틱웹의 의미를 살려서 제목이외에는 사용하지 않는 것이 좋다.
제목 태그를 중요한 의미로 받아들일 가능성이 높기 때문

- 글자 형태 태그(text formatting)
< b > 텍스트의 볼드체 지정, 중요한 의미 없음
<strong> 동일하게 볼드체 지정, 의미론적인 중요성의 의미를 갖는다

<i> italic체를 지정함(눕힙체), 중요한 의미 없음
<em> emphasized(강조, 중요한) text를 지정한다.i tag와 동일하게 Italic체로 표현된다.의미론적(Semantic) 중요성의 의미를 갖는다

<small> 작은 텍스트를 지정함(사이에 지정)
< mark > 형광펜으로 강조 텍스트 지정
<del> 삭제 텍스트 지정
<ins> 밑줄 텍스트 지정

<sub> 텍스트를 살짝 아래로 이동
<sup> 텍스트를 살짝 위로 이동
- 본문 태그
<p> 단락 지정
<br> 강제 개행, 종료 태그 없음
<pre> 형식화된 텍스트 지정, 작성된 그대로 브라우저에 표시
<hr> 수평줄 삽입, 종료 태그 없음

<q> 짧은 인용문을 지정(큰따옴표로 요소 감쌈)
< blockquote > 긴 인용문 블록을 지정

