1.8 Image & multimedia

- 이미지
웹 페이지에 이미지를 삽입하는 경우, img tag 를 사용한다.
src 이미지 파일 경로
alt 이미지 파일이 없을 경우 표시되는 문장
width 이미지의 넓이(css에서 지정하는 것이 일반적)
height 이미지의 높이(css에서 지정하는 것이 일반적)

- 오디오
src 음악 파일 경로
preload 재생 전에 음악 파일을 모두 불러올 것인지 지정
autoplay 음악파일을 자동의 재생 개시 할 것 인지 지정
loop 음악을 반복할 것인지 지정
controls 음악재생 도구를 표시할 것인지 지정

- 비디오
src 동영상 파일 경로
poster 동영상 준비 중에 표시될 이미지 파일 경로
preload 재생 전에 동영상 파일을 모두 불러올 것인지 지정
autoplay 동영상 파일을 자동의 재생 개시할 것인지 지정
loop 동영상을 반복할 것인지 지정
controls 동영상 재생 도구를 표시할 것인지 지정














